In [13]:
import pandas as pd

In [14]:
df=pd.read_excel('seriel_no.xlsx')
df

   sr no    name companie    growth  persen
0      2   sonam       it     76585      40
1      3    golu     java    587896      67
2      4   rohit   python    689567      78
3      5  dhuruv  striver    879789      67
4      6    poet    ocean      7878      79
5      7    roma      hcl   3445654      59
6      8    poet   google  76677676      90

In [15]:
df.loc[4]

sr no           6
name         poet
companie    ocean
growth       7878
persen         79
Name: 4, dtype: object

In [16]:
df.loc[1:3]

   sr no    name companie  growth  persen
1      3    golu     java  587896      67
2      4   rohit   python  689567      78
3      5  dhuruv  striver  879789      67

In [17]:
df.loc[1:3,"name"]

1      golu
2     rohit
3    dhuruv
Name: name, dtype: object

In [18]:
df.iloc[2]

sr no            4
name         rohit
companie    python
growth      689567
persen          78
Name: 2, dtype: object

In [19]:
df.iloc[:,0]

0    2
1    3
2    4
3    5
4    6
5    7
6    8
Name: sr no, dtype: int64